In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine, extract

In [2]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [3]:
engine.table_names()

/var/folders/lh/2pt476ks5r5_ln7lg89jxxbh0000gn/T/ipykernel_17371/4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['Bookings', 'Facilities', 'Members']

In [4]:
query10 = """ WITH fac_costs AS (
SELECT b.facid, f.name,
CASE WHEN b.memid = 0 THEN f.guestcost 
ELSE f.membercost END AS cost
FROM Bookings as b
    LEFT JOIN Facilities AS f
    ON b.facid = f.facid
)

SELECT DISTINCT name as facility, SUM(cost) AS total_revenue
FROM fac_costs
GROUP BY facility
HAVING total_revenue < 1000
"""

In [5]:
query11 = """
SELECT m1.surname || ', ' || m1.firstname AS member,
       m2.surname || ', ' || m2.firstname AS recommended_by
FROM Members AS m1
    INNER JOIN Members AS m2
    ON m1.recommendedby = m2.memid
WHERE m1.recommendedby IS NOT NULL
ORDER BY member
"""

In [6]:
query12 = """
SELECT f.name, SUM(b.slots) AS usage_by_mem
FROM Bookings AS b
    LEFT JOIN Facilities AS f
    ON b.facid = f.facid
WHERE b.memid != 0
GROUP BY f.name
"""

In [19]:
query13 = """
SELECT b.facid AS facility_id
    strftime('%m', starttime) AS month,
    SUM(b.slots) AS usage
FROM Bookings AS b
    LEFT JOIN Facilities as f
    ON b.facid = f.facid
GROUP BY month
"""

In [20]:
df = pd.read_sql_query(query13, engine)
df

  month  SUM(b.slots)
0    07          1486
1    08          3327
2    09          4378